izantout/C-Projects/TM4C123GH6PM/Whats the Weather/mainNokia5110.c
void mainPromptOutput(){
	UARTprintf("Welcome to my Embedded Weather Quester!\n");
	UARTprintf("Please choose your query criteria:\n");
	UARTprintf("1.	City Name\n");
	UARTprintf("2.	City ID\n");
	UARTprintf("3.	Geographic Coordinates\n");
	UARTprintf("4.	Zip Code\n");
	ST7735_FillScreen(ST7735_BLACK);
	UARTgets(choice, 2);
}



// Draw a raindrop using ST7735_FillCircle() function
void drawRainDrop(uint8_t x0, uint8_t y0, uint8_t r, uint16_t color) {
  int16_t f = 1 - r;
  int16_t ddF_x = 1;
  int16_t ddF_y = -2 * r;
  int16_t x = 0;
  int16_t y = r;

  ST7735_DrawFastVLine(x0, y0-r, r, color);
  ST7735_DrawFastVLine(x0, y0-r/2, r, color);
  ST7735_DrawFastVLine(x0, y0, r, color);

  while (x<y) {
    if (f >= 0) {
      y--;
      ddF_y += 2;
      f += ddF_y;
    }
    x++;
    ddF_x += 2;
    f += ddF_x;
  
    ST7735_DrawFastVLine(x0+x, y0-y, y, color);
    ST7735_DrawFastVLine(x0-x, y0-y, y, color);
    ST7735_DrawFastVLine(x0+y, y0-x, x, color);
    ST7735_DrawFastVLine(x0-y, y0-x, x, color);
  }
}



void makeItRain(){
		drawRainDrop(40, 100, 5, ST7735_BLUE);
		drawRainDrop(20, 110, 5, ST7735_BLUE);
		drawRainDrop(40, 120, 5, ST7735_BLUE);
		drawRainDrop(20, 130, 5, ST7735_BLUE);
		drawRainDrop(40, 140, 5, ST7735_BLUE);
		drawRainDrop(60, 103, 5, ST7735_BLUE);
		drawRainDrop(80, 113, 5, ST7735_BLUE);
		drawRainDrop(60, 123, 5, ST7735_BLUE);
		drawRainDrop(80, 133, 5, ST7735_BLUE);
		drawRainDrop(60, 143, 5, ST7735_BLUE);
		DelayWait10ms(500);
		drawRainDrop(40, 100, 5, ST7735_BLACK);
		drawRainDrop(20, 110, 5, ST7735_BLACK);
		drawRainDrop(40, 120, 5, ST7735_BLACK);
		drawRainDrop(20, 130, 5, ST7735_BLACK);
		drawRainDrop(40, 140, 5, ST7735_BLACK);
		drawRainDrop(60, 103, 5, ST7735_BLACK);
		drawRainDrop(80, 113, 5, ST7735_BLACK);
		drawRainDrop(60, 123, 5, ST7735_BLACK);
		drawRainDrop(80, 133, 5, ST7735_BLACK);
		drawRainDrop(60, 143, 5, ST7735_BLACK);
		
		drawRainDrop(20, 100, 5, ST7735_BLUE);
		drawRainDrop(40, 110, 5, ST7735_BLUE);
		drawRainDrop(20, 120, 5, ST7735_BLUE);
		drawRainDrop(40, 130, 5, ST7735_BLUE);
		drawRainDrop(20, 140, 5, ST7735_BLUE);
		drawRainDrop(80, 103, 5, ST7735_BLUE);
		drawRainDrop(60, 113, 5, ST7735_BLUE);
		drawRainDrop(80, 123, 5, ST7735_BLUE);
		drawRainDrop(60, 133, 5, ST7735_BLUE);
		drawRainDrop(80, 143, 5, ST7735_BLUE);
		DelayWait10ms(500);
		drawRainDrop(20, 100, 5, ST7735_BLACK);
		drawRainDrop(40, 110, 5, ST7735_BLACK);
		drawRainDrop(20, 120, 5, ST7735_BLACK);
		drawRainDrop(40, 130, 5, ST7735_BLACK);
		drawRainDrop(20, 140, 5, ST7735_BLACK);
		drawRainDrop(80, 103, 5, ST7735_BLACK);
		drawRainDrop(60, 113, 5, ST7735_BLACK);
		drawRainDrop(80, 123, 5, ST7735_BLACK);
		drawRainDrop(60, 133, 5, ST7735_BLACK);
		drawRainDrop(80, 143, 5, ST7735_BLACK);
}


void drawSun(uint8_t x0, uint8_t y0, uint8_t r, uint16_t color) {
    // Draw a circle for the sun
    ST7735_FillCircle(x0, y0, r, color);
  
    // Draw rays coming out of the sun
		ST7735_DrawLine(x0+20, y0+20, x0+30, y0+30, ST7735_YELLOW);
		ST7735_DrawLine(x0-20, y0-20, x0-30, y0-30, ST7735_YELLOW);
		ST7735_DrawLine(x0+20, y0-20, x0+30, y0-30, ST7735_YELLOW);
		ST7735_DrawLine(x0-20, y0+20, x0-30, y0+30, ST7735_YELLOW);
		DelayWait10ms(500);
		ST7735_DrawLine(x0+20, y0+20, x0+30, y0+30, ST7735_BLACK);
		ST7735_DrawLine(x0-20, y0-20, x0-30, y0-30, ST7735_BLACK);
		ST7735_DrawLine(x0+20, y0-20, x0+30, y0-30, ST7735_BLACK);
		ST7735_DrawLine(x0-20, y0+20, x0-30, y0+30, ST7735_BLACK);
	
		ST7735_DrawLine(x0+20, y0, x0+30, y0, ST7735_YELLOW);
		ST7735_DrawLine(x0-20, y0, x0-30, y0, ST7735_YELLOW);
		ST7735_DrawLine(x0, y0-20, x0, y0-30, ST7735_YELLOW);
		ST7735_DrawLine(x0, y0+20, x0, y0+30, ST7735_YELLOW);
		DelayWait10ms(500);
		ST7735_DrawLine(x0+20, y0, x0+30, y0, ST7735_BLACK);
		ST7735_DrawLine(x0-20, y0, x0-30, y0, ST7735_BLACK);
		ST7735_DrawLine(x0, y0-20, x0, y0-30, ST7735_BLACK);
		ST7735_DrawLine(x0, y0+20, x0, y0+30, ST7735_BLACK);
}

void drawCloud(uint8_t x0, uint8_t y0, uint8_t r, uint16_t color){
	ST7735_FillCircle(x0, y0, r, color);
	ST7735_FillCircle(x0+10, y0-10, r, color);
	ST7735_FillCircle(x0+20, y0, r, color);
	DelayWait10ms(500);
	ST7735_FillCircle(x0, y0, r, ST7735_BLACK);
	ST7735_FillCircle(x0+10, y0-10, r, ST7735_BLACK);
	ST7735_FillCircle(x0+20, y0, r, ST7735_BLACK);
	
	ST7735_FillCircle(x0+30, y0, r, color);
	ST7735_FillCircle(x0+40, y0-10, r, color);
	ST7735_FillCircle(x0+50, y0, r, color);
	DelayWait10ms(500);
	ST7735_FillCircle(x0+30, y0, r, ST7735_BLACK);
	ST7735_FillCircle(x0+40, y0-10, r, ST7735_BLACK);
	ST7735_FillCircle(x0+50, y0, r, ST7735_BLACK);
	
	ST7735_FillCircle(x0+60, y0, r, color);
	ST7735_FillCircle(x0+70, y0-10, r, color);
	ST7735_FillCircle(x0+80, y0, r, color);
	DelayWait10ms(500);
	ST7735_FillCircle(x0+60, y0, r, ST7735_BLACK);
	ST7735_FillCircle(x0+70, y0-10, r, ST7735_BLACK);
	ST7735_FillCircle(x0+80, y0, r, ST7735_BLACK);
}

void drawingDesign(char weather[MAXLEN]){
	if(strstr(weather, "rain")){
		makeItRain();
	} else if (strstr(weather, "sun") || strstr(weather, "clear")){
		drawSun(50, 120, 20, ST7735_YELLOW);
	} else if (strstr(weather, "cloud") || strstr(weather, "clouds") || strstr(weather, "cloudy")){
		drawCloud(30, 130, 10, ST7735_WHITE);
	} else {
	}
}

int main(void){
  int32_t retVal = 0;
  char *pConfig = NULL;
  retVal = initializeAppVariables();
  stopWDT();        // Stop WDT 
  initClk();        // PLL 50 MHz
  LCD_Init();
  LED_Init();       // initialize LaunchPad I/O 
	mainPromptOutput();
	switch (choice[0]) {
    case '1':
				UARTprintf("You chose option 1.\nPlease enter the city name: ");
				UARTgets(cityInput, 200);
				UARTprintf("You chose: ");
				UARTprintf(cityInput);
				UARTprintf("\n");
				strcpy(sendRequest,cityQ);
				strcat(sendRequest,cityInput);
				strcat(sendRequest,requestEnd);
				strcpy(cityInput,sendRequest);
        break;
    case '2':
        UARTprintf("You chose option 2.\n");
				UARTprintf("City ID: ");
				UARTgets(cityInput,200);
				UARTprintf("You chose: ");
				UARTprintf(cityInput);
				UARTprintf("\n");
				strcpy(sendRequest,cityId);
				strcat(sendRequest,cityInput);
				strcat(sendRequest,requestEnd);
				strcpy(cityInput,sendRequest);
        break;
    case '3':
        UARTprintf("You chose option 3.\n");
				UARTprintf("User lat: ");
				UARTgets(cityInput,200);
				UARTprintf("You chose: ");
				UARTprintf(cityInput);
				UARTprintf("\n");
				strcpy(sendRequest,cityLat);
				strcat(sendRequest,cityInput);
				strcat(sendRequest,cityLong);
				UARTprintf("User long: ");
				UARTgets(cityInput,200);
				UARTprintf("You chose: ");
				UARTprintf(cityInput);
				UARTprintf("\n");
				strcat(sendRequest,cityInput);
				strcat(sendRequest,requestEnd);
				strcpy(cityInput,sendRequest);
        break;
    case '4':
			UARTprintf("You chose option 4.\nPlease enter the city Zipcode: ");
				UARTgets(cityInput, 200);
				UARTprintf("You chose: ");
				UARTprintf(cityInput);
				UARTprintf("\n");
				strcpy(sendRequest,cityZip);
				strcat(sendRequest,cityInput);
				strcat(sendRequest,requestEnd);
				strcpy(cityInput,sendRequest);
        break;
    default:
        UARTprintf("Invalid input.\n");
}
  /*
     * Following function configures the device to default state by cleaning
     * the persistent settings stored in NVMEM (viz. connection profiles &
     * policies, power policy etc)
     *
     * Applications may choose to skip this step if the developer is sure
     * that the device is in its default state at start of application
     *
     * Note that all profiles and persistent settings that were done on the
     * device will be lost
     */
  retVal = configureSimpleLinkToDefaultState(pConfig);
  if(retVal < 0){
    if(DEVICE_NOT_IN_STATION_MODE == retVal){
       LCD_OutString(" Failed to configure the device in its default state \r\n");
       Crash(4000000);
    }
  }

