izantout/C-Projects/TM4C123GH6PM/Whats the Weather/mainNokia5110.c
    \param[in]  None

    \return     None

    \note

    \warning    If the WLAN connection fails or we don't aquire an IP address,
                We will be stuck in this function forever.
******************************************************************************
*/
void WlanConnect(void){
  SlSecParams_t secParams;

  secParams.Key = PASSKEY;
  secParams.KeyLen = strlen(PASSKEY);
  secParams.Type = SEC_TYPE; // OPEN, WPA, or WEP

  sl_WlanConnect(SSID_NAME, strlen(SSID_NAME), 0, &secParams, 0);

  while((0 == (g_Status & CONNECTED)) || (0 == (g_Status & IP_AQUIRED))){
    _SlNonOsMainLoopTask();
  }
}
/*!
    \brief Get the Weather from server

    \param[in]      none

    \return         zero for success and -1 for error

    \warning
*/
static int32_t getWeather(void){uint32_t i;
  char *pt = NULL;

  memcpy(appData.HostName,SERVER,strlen(SERVER));
  if(GetHostIP() == 0){
    if( (appData.SockID = CreateConnection()) < 0 ) return -1;

/* HTTP GET string. */
    strcpy(appData.SendBuff,sendRequest); 
// 1) change Austin Texas to your city
// 2) you can change metric to imperial if you want temperature in F
    /* Send the HTTP GET string to the open TCP/IP socket. */
    sl_Send(appData.SockID, appData.SendBuff, strlen(appData.SendBuff), 0);

/* Receive response */
    sl_Recv(appData.SockID, &appData.Recvbuff[0], MAX_RECV_BUFF_SIZE, 0);
    appData.Recvbuff[strlen(appData.Recvbuff)] = '\0';

/* find ticker name in response*/
    pt = strstr(appData.Recvbuff, "\"name\"");
    i = 0; 
    if( NULL != pt ){
      pt = pt + 8; // skip over "name":"
      while((i<MAXLEN)&&(*pt)&&(*pt!='\"')){
        City[i] = *pt; // copy into City string
        pt++; i++;    
      }
    }
    City[i] = 0;

/* find Temperature Value in response */
    pt = strstr(appData.Recvbuff, "\"temp\"");
    i = 0; 
    if( NULL != pt ){
      pt = pt + 7; // skip over "temp":
      while((i<MAXLEN)&&(*pt)&&(*pt!=',')){
        Temperature[i] = *pt; // copy into Temperature string
        pt++; i++;    
      }
    }
    Temperature[i] = 0;
		
		/* find min temp Value in response */
    pt = strstr(appData.Recvbuff, "\"temp_min\"");
    i = 0; 
    if( NULL != pt ){
      pt = pt + 11; // skip over "temp_min":
      while((i<MAXLEN)&&(*pt)&&(*pt!=',')){
        tempMin[i] = *pt; // copy into tempMin string
        pt++; i++;    
      }
    }
    tempMin[i] = 0;
		
		/* find max temp Value in response */
    pt = strstr(appData.Recvbuff, "\"temp_max\"");
    i = 0; 
    if( NULL != pt ){
      pt = pt + 11; // skip over "temp_max":
      while((i<MAXLEN)&&(*pt)&&(*pt!=',')){
        tempMax[i] = *pt; // copy into tempMax string
        pt++; i++;    
      }
    }
    tempMax[i] = 0;

		/* find weather in response */
    pt = strstr(appData.Recvbuff, "\"description\"");
    i = 0; 
    if( NULL != pt ){
      pt = pt + 15; // skip over "description":"
      while((i<MAXLEN)&&(*pt)&&(*pt!='\"')){
        Weather[i] = *pt; // copy into weather string
        pt++; i++;    
      }
    }
    Weather[i] = 0;   
		
		/* find humidity in response */
    pt = strstr(appData.Recvbuff, "\"humidity\"");
    i = 0; 
    if( NULL != pt ){
      pt = pt + 11; // skip over "humidity":"
      while((i<MAXLEN)&&(*pt)&&(*pt!='}')){
        Humidity[i] = *pt; // copy into humidity string
        pt++; i++;    
      }
    }
    Humidity[i] = 0;
		
    sl_Close(appData.SockID);
  }

  return 0;
}
